backend/app/controllers/api/v1/departments_controller.rb

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_department
      @department = Department.find(params[:id])