backend/app/controllers/api/v1/mentors_controller.rb

SELECT "mentors".* FROM "mentors"
---
  def index
    @mentors = Mentor.all

INSERT INTO "mentors" ("name", "title", "about", "image_url", "department_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @mentor = Mentor.new(mentor_params)

    if @mentor.save

DELETE FROM "mentors" WHERE "mentors"."id" = ?  [["id", 1]]
---
  def destroy
    @mentor.destroy

SELECT "mentors".* FROM "mentors" WHERE "mentors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_mentor
      @mentor = Mentor.find(params[:id])